# ~/.dotfiles/Brewfile — machine provisioning

tap "oven-sh/bun"

# Modern CLI / TUI ecosystem
brew "bat"          # cat replacement with syntax highlighting
brew "eza"          # ls replacement (maintained fork of exa)
brew "btop"         # system monitor TUI
brew "neovim"       # editor
brew "fzf"          # fuzzy finder
brew "ripgrep"      # fast grep
brew "fd"           # fast find
brew "zoxide"       # smart cd
brew "lazygit"      # git TUI
brew "dust"         # modern du (disk usage by directory)
brew "duf"          # modern df (disk free space)
brew "procs"        # modern ps
brew "sd"           # modern sed
brew "hyperfine"    # CLI benchmarking
brew "glow"

# Dotfile management
brew "stow"         # symlink manager

# Classics
brew "tmux"         # terminal multiplexer
brew "git"          # version control
brew "gh"           # GitHub CLI
brew "uv"           # fast python package manager

# Runtime dependencies
brew "oven-sh/bun/bun"          # needed for oh-my-pi + claude-code

# Utilities
brew "curl"         # HTTP client (brew version stays current)
brew "jq"           # JSON processor
brew "delta"        # syntax-highlighting git pager
brew "tealdeer"     # simplified man pages (fast Rust tldr)
brew "tree"         # directory visualization
brew "wget"         # file downloader
brew "shellcheck"   # shell script linter
brew "trash"        # safer rm (moves to macOS trash)
brew "yazi"         # terminal file manager
brew "pandoc"       # document conversion

# GUI apps
cask "keepassxc"    # password manager
cask "spotify"      # music
cask "obsidian"     # notes
cask "ghostty"      # terminal
cask "notion"       # docs & wiki
cask "stats"        # macOS system monitor menubar

# AI coding agents
cask "codex"        # OpenAI codex CLI
cask "basictex"     # minimal LaTeX for pandoc PDF rendering
brew "gemini-cli"

# R stuff
brew "air"

# Fonts
cask "font-fira-code-nerd-font"
